'use strict'

// ----------------------------1---------------------------------


// let age = prompt('Вкажи твій вік', 0);

// if (age >= 0 && age < 2) {
//     alert('Ти дітьо');
// }
// else if (age >= 12 && age < 18) {
//     alert('Ти підсвинок');
// }
// else if (age >= 18 && age < 60) {
//     alert('Ти дорослий');
// }
// else if (age >= 60) {
//     alert('Йди по пенсію');
// } 

// -----------------------------2---------------------------------

// let num = prompt('Напиши число від 0-9', 0)

// switch (num) {
//     case '1':
//         alert('!');
//         break;

//     case '2':
//         alert('"');
//         break;

//     case '3':
//         alert('#');
//         break;

//     case '4':
//         alert('$')
//         break;

//     case '5':
//         alert('%')
//         break;

//     case '6':
//         alert('^')
//         break;

//     case '7':
//         alert('&')
//         break;

//     case '8':
//         alert('*')
//         break;

//     case '9':
//         alert('(')
//         break;

//     case '0':
//         alert(')')
//         break;

//     default:
//         alert('Для кого писало від 0 до 9?? Спробуй ще раз')
// }

// ------------------------------3---------------------------------

// let number = prompt('Напиши сюди 3-х значне число від 000 до 999')

// if (number[0] == number[1] || number[0] == number[2] || number[1] == number[2]) {
//     alert('У вас є одинакові числа');
// }
// else
//     alert('У вас немає однакових чисел');

// ------------------------------4---------------------------------

// let year = prompt('Вкажіть рік,а я перевірю чи він високосний.')

// if (year % 4 == 0 && year % 100 !== 0) {
//     alert('Це високосний рік');
// }
// else
//     alert('Це не високосний рік');

// ------------------------------5---------------------------------

// let number = prompt('Вкажіть число')

// if (number === number.split('').reverse().join(''))
//     alert('Це паліндром');
// else
//     alert('Це не є паліндром');

// ------------------------------6---------------------------------

// let dollar = prompt('Введи тут к-сть доларів', 0)
// let choose = prompt('EUR = 1, UAH = 2, AZN = 3', 0);

// switch (choose) {
//     case '1':
//         alert(dollar * 0.89 + ' EUR');
//         break;
//     case '2':
//         alert(dollar * 26.65 + ' UAH');
//         break;
//     case '3':
//         alert(dollar * 1.7 + ' AZN');
//         break;
// }

// ------------------------------7---------------------------------

// let price = prompt('Введи тут суму покупки,а я вирахую знижку')

// if (price >= 200 && price < 300)
//     alert(price / 100 * 97 + '$ до оплати у вас знижка 3%');
// else if (price >= 300 && price < 500)
//     alert(price / 100 * 95 + '$ до оплати у вас знижка 5%');
// else if (price >= 500)
//     alert(price / 100 * 93 + '$ до оплати у вас знижка 7%');

// ------------------------------8---------------------------------

// let radius = prompt('Вкажіть довжину круга')
// let per = prompt('Вкажіть периметр квадрата')

// alert(radius <= per / 2)

// ------------------------------9---------------------------------

// let howYear = prompt('Який зараз рік? 2020 = 1, 2019 = 2, 2021 = 3')
// let presidentUsa = prompt('Хто теперішній президент Америки? Обама = 1, Трамп = 2, Зеленський = 3')
// let HowGagarin = prompt('Гарарін- це... Космонавт = 1, Футболіст = 2, Архітектор = 3')
// let score = 0

// if (howYear == 1)
//     score += 2;
// if (presidentUsa == 2)
//     score += 2;
// if (HowGagarin == 1)
//     score += 2;
// alert('Ти набрав ' + score);

// ------------------------------10--------------------------------

// let date = prompt('Введи тут дату(день-місяць-рік)');
// date = date.split('-');
// let oldDate = new Date(date[2], date[1] - 1, date[0]);
// oldDate.setDate(oldDate.getDate() + 1);
// alert(oldDate);